Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Compares two legend settings objects.
other:
Legend settings object to compare to.
Returns:
True if objects are equal, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.NumberForScale
A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically).
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ScaleHeight
Height of scale (for Diagram display). Measured in paperspace units.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: scaleHeight is greater than 10000 or less than 0
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ColorRangeHeight
Height of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: colorRangeHeight is greater than 10000 or less than 0
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ColorRangeWidth
Width of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: colorRangeWidth is greater than 10000 or less than 0
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.NumberOfSteps
Number of steps (values between minimum and maximum) to be shown in legend.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: numberOfSteps is greater than 1000 or less than 0
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.Rounding
Rounding increment for numeric values of analysis results.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: rounding is not positive
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowDataDescription
If true, data description is shown in the legend.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowDataName
If true, data name is shown in the legend.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowUnits
If true, units are shown in the legend.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowLegend
If true, legend is shown in the view.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.HeadingTextTypeId
Element id of text associated with legend heading.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.TextTypeId
Element id of text associated with legend body.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor
Constructs a default instance of legend settings.
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Constructs a new copy of the input AnalysisDisplayLegendSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings
Contains legend settings for analysis display style element.
Since:
2011